package com.app3_스레드;

public class ThreadTest {

	public static void main(String[] args) {

		/*
		 * 
		 *    1) 프로세스(process)
		 *    		- 실행중인 프로그램 (메모리에 로드 + cpu 처리)
		 *    		- 멀티 테스킹: 하나의 cpu에서 여러 개의 프로세스가 실행되는 것
		 *    			이러한 프로세스는 각각 자원 및 메모리 영역을 갖는다. (공유 안됨)
		 *    		- 멀티 프로세스: 여러 개의 cpu를 이용하여 처리
		 *    
		 *    
		 *    
		 *    2) 스레드(thread)
		 *    		- 프로세스 안에서 동작하는 세부적인작업 단위로서
		 *    		  여러 스레드가 모여서 하나의 프로세스를 이룬다.
		 *    		- 가장 큰 특징 2가지
		 *    			a. 병행절
		 *    			b. 데이터 공유
		 *    		- 멀티 스레드: 하나의 프로세스 안에 여러 개의 스레드가 실행되고 있는 것
		 *    
		 *    
		 */
	}

}
