package com.app4_컬렉션API;

import java.util.ArrayList;

public class TestMain {

	public static void main(String[] args) {

		/*
		 * 
		 *     자바의 데이터 저장 방법 3가지
		 *     
		 *     1. 변수
		 *     		- 하나의 데이터 저장용
		 *     		- 기본형 변수와 참조형 변수 
		 *     
		 *     2. 배열
		 *     		- 여러 데이터 저장
		 *     		- 무조건 참조형 변수
		 *     		- 특징: 동일 데이터만 저장 가능 
		 *     			   크기 변경 불가(데이터 관리 어렵다) 
		 *     			   접근시 인덱스(첨자) 사용 
		 *     			   배열과 관련된 메서드가 없다. (Arrays 유틸리티 제외)
		 *     
		 *     3. 컬렉션 API
		 *     		- 여러 데이터 저장
		 *     		- 참조형 변수 
		 *     		- 특징: 모든 데이터 저장 가능 
		 *     			   크기 변경 가능(추가, 삽입, 수정, 삭제) 
		 *     			   접근시 메서드를 사용
		 *     			   다양한 메서드 제공 
		 */
		
	
	}

}
